#1
a = [1, 5, 10, 35, 17, 3, 59, 100, 78, 6]
if 3 in a:
    index = a.index(3)
    a[index] =30
print(a)

#2
a = [2, 4, 6, 8, 10, 20]
b = [x**2 for x in a]
print(b)


#3
a = [5, 8, 11, 12, 20]
b = max(a)
c = b // len(a)
print(c)

#4
b = [1,3,12563, -45, -5]
b = sorted(b)
print(b)

#5
goods = {"Мандарины": {
    "цена" : 150
},
    "Персики": {
        "цена": 270
},
    "Нектарины": {
        "цена": 260
},
    "Бананы": {
        "цена": 50
},
    "Виноград": {
        "цена": 130
}}
b = max(goods)
c = min(goods)
print(c)
print(b)

#6
pers = {"Артём": {
    "возраст" : 18,
    "рост" : 185
},
    "Доминик": {
        "возраст": 30,
        "рост": 170
},
        "Семён": {
        "возраст": 23,
        "рост": 190
},
       "Егор": {
        "возраст": 52,
        "рост": 195
}}

print(pers["Артём"])

#7
t = {'apple': 'яблоко', 'cat': 'кот', 'dog': 'собака'}
r = input("Введите русское слово: ")
for eng, rus in t.items():
    if rus == r:
        print("Перевод -", eng)
        break
else:
    print("Слово не найдено")

#8
import random
choices = ["камень", "ножницы", "бумага", "ящерица", "спок"]
rules = {
    "ножницы": ["бумага", "ящерица"],
    "бумага": ["камень", "спок"],
    "камень": ["ножницы", "ящерица"],
    "ящерица": ["бумага", "спок"],
    "спок": ["ножницы", "камень"]
}

user = input("Ваш ход: ").lower()
comp = random.choice(choices)
print(f"Компьютер: {comp}")

if user not in choices:
    print("Ошибка ввода!")
elif user == comp:
    print("Ничья!")
elif comp in rules[user]:
    print("Вы выиграли!")
else:
    print("Вы проиграли!")
